# import libraries and  load csv file

In [1]:
import pandas as pd
import numpy as np
from datetime import datetime as dt

In [2]:
df = pd.read_csv(r'E:\1.Data analysis document\POWER BI\Raw data\Coffee Shop Sales.csv')
df

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail
0,1,1/1/2023,7:06:11 AM,2,5,Lower Manhattan,32,3.00,Coffee,Gourmet brewed coffee,Ethiopia Rg
1,2,1/1/2023,7:08:56 AM,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg
2,3,1/1/2023,7:14:04 AM,2,5,Lower Manhattan,59,4.50,Drinking Chocolate,Hot chocolate,Dark chocolate Lg
3,4,1/1/2023,7:20:24 AM,1,5,Lower Manhattan,22,2.00,Coffee,Drip coffee,Our Old Time Diner Blend Sm
4,5,1/1/2023,7:22:41 AM,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg
...,...,...,...,...,...,...,...,...,...,...,...
149111,149452,6/30/2023,8:18:41 PM,2,8,Hell's Kitchen,44,2.50,Tea,Brewed herbal tea,Peppermint Rg
149112,149453,6/30/2023,8:25:10 PM,2,8,Hell's Kitchen,49,3.00,Tea,Brewed Black tea,English Breakfast Lg
149113,149454,6/30/2023,8:31:34 PM,1,8,Hell's Kitchen,45,3.00,Tea,Brewed herbal tea,Peppermint Lg
149114,149455,6/30/2023,8:57:19 PM,1,8,Hell's Kitchen,40,3.75,Coffee,Barista Espresso,Cappuccino
149115,149456,6/30/2023,8:57:19 PM,2,8,Hell's Kitchen,64,0.80,Flavours,Regular syrup,Hazelnut syrup

# Check data type and missing data

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149116 entries, 0 to 149115
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   transaction_id    149116 non-null  int64
 1   transaction_date  149116 non-null  object
 2   transaction_time  149116 non-null  object
 3   transaction_qty   149116 non-null  int64
 4   store_id          149116 non-null  int64
 5   store_location    149116 non-null  object
 6   product_id        149116 non-null  int64
 7   unit_price        149116 non-null  float64
 8   product_category  149116 non-null  object
 9   product_type      149116 non-null  object
 10  product_detail    149116 non-null  object
dtypes: float64(1), int64(4), object(6)
memory usage: 12.5+ MB

# Combine transaction date and time

In [4]:
df['transaction_datetime'] = df['transaction_date'] +' '+ df['transaction_time']

In [5]:
df.drop(columns=['transaction_date','transaction_time'], inplace= True)

In [6]:
df

,transaction_id,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail,transaction_datetime
0,1,2,5,Lower Manhattan,32,3.00,Coffee,Gourmet brewed coffee,Ethiopia Rg,1/1/2023 7:06:11 AM
1,2,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,1/1/2023 7:08:56 AM
2,3,2,5,Lower Manhattan,59,4.50,Drinking Chocolate,Hot chocolate,Dark chocolate Lg,1/1/2023 7:14:04 AM
3,4,1,5,Lower Manhattan,22,2.00,Coffee,Drip coffee,Our Old Time Diner Blend Sm,1/1/2023 7:20:24 AM
4,5,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,1/1/2023 7:22:41 AM
...,...,...,...,...,...,...,...,...,...,...
149111,149452,2,8,Hell's Kitchen,44,2.50,Tea,Brewed herbal tea,Peppermint Rg,6/30/2023 8:18:41 PM
149112,149453,2,8,Hell's Kitchen,49,3.00,Tea,Brewed Black tea,English Breakfast Lg,6/30/2023 8:25:10 PM
149113,149454,1,8,Hell's Kitchen,45,3.00,Tea,Brewed herbal tea,Peppermint Lg,6/30/2023 8:31:34 PM
149114,149455,1,8,Hell's Kitchen,40,3.75,Coffee,Barista Espresso,Cappuccino,6/30/2023 8:57:19 PM
149115,149456,2,8,Hell's Kitchen,64,0.80,Flavours,Regular syrup,Hazelnut syrup,6/30/2023 8:57:19 PM

# Change data type

In [7]:
df['transaction_datetime'] = pd.to_datetime(df['transaction_datetime'])
df

,transaction_id,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail,transaction_datetime
0,1,2,5,Lower Manhattan,32,3.00,Coffee,Gourmet brewed coffee,Ethiopia Rg,2023-01-01 07:06:11
1,2,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,2023-01-01 07:08:56
2,3,2,5,Lower Manhattan,59,4.50,Drinking Chocolate,Hot chocolate,Dark chocolate Lg,2023-01-01 07:14:04
3,4,1,5,Lower Manhattan,22,2.00,Coffee,Drip coffee,Our Old Time Diner Blend Sm,2023-01-01 07:20:24
4,5,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,2023-01-01 07:22:41
...,...,...,...,...,...,...,...,...,...,...
149111,149452,2,8,Hell's Kitchen,44,2.50,Tea,Brewed herbal tea,Peppermint Rg,2023-06-30 20:18:41
149112,149453,2,8,Hell's Kitchen,49,3.00,Tea,Brewed Black tea,English Breakfast Lg,2023-06-30 20:25:10
149113,149454,1,8,Hell's Kitchen,45,3.00,Tea,Brewed herbal tea,Peppermint Lg,2023-06-30 20:31:34
149114,149455,1,8,Hell's Kitchen,40,3.75,Coffee,Barista Espresso,Cappuccino,2023-06-30 20:57:19
149115,149456,2,8,Hell's Kitchen,64,0.80,Flavours,Regular syrup,Hazelnut syrup,2023-06-30 20:57:19

In [8]:
df['transaction_date'] = df['transaction_datetime'].dt.date

In [9]:
df['transaction_time'] = df['transaction_datetime'].dt.floor('H').dt.time

# Adding columns

In [17]:
df['transaction_month'] = df['transaction_datetime'].dt.strftime('%b %Y')
df

,transaction_id,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail,transaction_datetime,transaction_date,transaction_time,transaction_month,total_sale
0,1,2,5,Lower Manhattan,32,3.00,Coffee,Gourmet brewed coffee,Ethiopia Rg,2023-01-01 07:06:11,2023-01-01,07:00:00,Jan 2023,6.00
1,2,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,2023-01-01 07:08:56,2023-01-01,07:00:00,Jan 2023,6.20
2,3,2,5,Lower Manhattan,59,4.50,Drinking Chocolate,Hot chocolate,Dark chocolate Lg,2023-01-01 07:14:04,2023-01-01,07:00:00,Jan 2023,9.00
3,4,1,5,Lower Manhattan,22,2.00,Coffee,Drip coffee,Our Old Time Diner Blend Sm,2023-01-01 07:20:24,2023-01-01,07:00:00,Jan 2023,2.00
4,5,2,5,Lower Manhattan,57,3.10,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,2023-01-01 07:22:41,2023-01-01,07:00:00,Jan 2023,6.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149111,149452,2,8,Hell's Kitchen,44,2.50,Tea,Brewed herbal tea,Peppermint Rg,2023-06-30 20:18:41,2023-06-30,20:00:00,Jun 2023,5.00
149112,149453,2,8,Hell's Kitchen,49,3.00,Tea,Brewed Black tea,English Breakfast Lg,2023-06-30 20:25:10,2023-06-30,20:00:00,Jun 2023,6.00
149113,149454,1,8,Hell's Kitchen,45,3.00,Tea,Brewed herbal tea,Peppermint Lg,2023-06-30 20:31:34,2023-06-30,20:00:00,Jun 2023,3.00
149114,149455,1,8,Hell's Kitchen,40,3.75,Coffee,Barista Espresso,Cappuccino,2023-06-30 20:57:19,2023-06-30,20:00:00,Jun 2023,3.75
149115,149456,2,8,Hell's Kitchen,64,0.80,Flavours,Regular syrup,Hazelnut syrup,2023-06-30 20:57:19,2023-06-30,20:00:00,Jun 2023,1.60

In [16]:
df['total_sale'] = df['transaction_qty']*df['unit_price']

# Analysis

## Total sales, qty and transaction

In [11]:
total_sales = (df['transaction_qty']*df['unit_price']).sum()

In [12]:
total_qty = df['transaction_qty'].sum()

In [13]:
total_transaction = df['transaction_id'].nunique()
total_transaction

149116

## analysis per month

### generate order month list

In [14]:
start_month = pd.to_datetime(df['transaction_date']).min()
end_month = pd.to_datetime(df['transaction_date']).max()
months_range = pd.date_range(start_month, end_month,freq='MS').strftime('%b %Y')
months_range

Index(['Jan 2023', 'Feb 2023', 'Mar 2023', 'Apr 2023', 'May 2023', 'Jun 2023'], dtype='object')

In [19]:
group_by = df.groupby('transaction_month')[['total_sale','transaction_qty','transaction_id']].agg({'total_sale':'sum','transaction_qty':'sum', 'transaction_id':'count'}).loc[months_range].reset_index()
group_by

      index  total_sale  transaction_qty  transaction_id
0  Jan 2023    81677.74            24870           17314
1  Feb 2023    76145.19            23550           16359
2  Mar 2023    98834.68            30406           21229
3  Apr 2023   118941.08            36469           25335
4  May 2023   156727.76            48233           33527
5  Jun 2023   166485.88            50942           35352

# Top 5 products

In [24]:
top_productsale = df.groupby('product_type')[['total_sale','transaction_qty','transaction_id']].agg(
    {
        'total_sale':'sum',
        'transaction_qty':'sum',
        'transaction_id':'count'
    }
).reset_index().sort_values(by='total_sale',ascending= False)
top_productsale.head(5)

             product_type  total_sale  transaction_qty  transaction_id
0        Barista Espresso    91406.20            24943           16403
4         Brewed Chai tea    77081.95            26250           17183
17          Hot chocolate    72416.00            17457           11468
13  Gourmet brewed coffee    70034.60            25973           16912
3        Brewed Black tea    47932.00            17462           11350

# Top 5 bottom products

In [25]:
top_productsale.tail(5)

         product_type  total_sale  transaction_qty  transaction_id
2           Black tea     2711.85              303             303
28   Sugar free syrup     2324.00             2905            1811
21  Organic Chocolate     1679.60              221             221
15          Green tea     1470.75              159             159
14        Green beans     1340.00              134             134